'''
Break => หยุดการทำซ้ำ
Continue => ข้ามการทำงาน
'''
i = 1
y = 1
x = 1
z = 1
a = 1
while i <= 10:
    print("รอบที่ : " , i) 
    if (i==5):
        break
    i += 1

print("============================")

while y <= 10:
    y += 1
    if (y==5):
        continue
    print("รอบที่ : " , y) 
# มีถึงรอบที่ 11 เพราะ เอาไปบวกเพิ่มก่อนค่อยแสดงผล 10 ตรงตามเงื่อนไข เลขเอาไป + เพิ่ม 1

print("============================")

# แสดงแต่เลข คู่
while x < 10:
    x += 1
    if (x%2 != 0):
        continue
    print("รอบที่ : " , x)

print("============================")

# แสดงเลข คี่
while z < 10:
    z += 1
    if (z%2 == 0):
        continue
    print("รอบที่ : " , z)

print("============================")

for a in range(1,11):
    if(a % 2 == 0):
        continue
    print(a)