'''
ตัวแปรและชนิดข้อมูล
'''

# โครงสร้าง => ชื่อตัวแปร = ค่าที่เก็บในตัวแปร
x = 20
y = 3.99
z = True
print("Total : " + str(x)) #แปลง x ให้เป็น string โดยการใส่ str ครอบไว้
print(y)
print(z)

# วิธีเช็คชนิดข้อมูล
print(type(y))
print(type("Hello"))

'''
กฏการตั้งชื่อ
'''

'''
1. ใส่ตัวเลข ตัวอักษร เครื่องหมาย
2. ห้ามขึ้นต้นด้วยตัวเลขและสัญลักษณ์ ยกเว้น _
3. ห้ามซ้พกับ keyword
4. case sensitive ตัวพิมพ์เล็กและพิมพ์ใหญ่
'''

a = 10
_a1 = "Hello"
# if class def

name = "a"
Name = "A"
print(name)